Revit 2026 API

# ComponentRepeaterIterator Properties

---

The ComponentRepeaterIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ComponentRepeaterIterator Class

Autodesk.Revit.DB Namespace